## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                  RESOURCE                   |
|----------|---------------------------------------------|
| update   | `aws_cloudfront_distribution.superset_docs` |
| recreate | `aws_route53_record.superset_docs_A`        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_distribution.superset_docs will be updated in-place
  ~ resource "aws_cloudfront_distribution" "superset_docs" {
      ~ http_version                    = "http2" -> "http2and3"
        id                              = "EEC9BUT3BBF9O"
        tags                            = {
            "CostCentre" = "cds-superset-docs-staging"
            "Terraform"  = "true"
        }
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_route53_record.superset_docs_A must be replaced
-/+ resource "aws_route53_record" "superset_docs_A" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "docs.superset.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z0481375299P05DGLL1KP_docs.superset.cdssandbox.xyz_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "docs.superset.cdssandbox.xyz"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ type                             = "A" -> "HTTPS" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_docs_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.superset_docs"]

20 tests, 18 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
